import {TG, DZ, Ten, ZhangSheng} from './wuxing';

export default {
  [TG.甲]: `
  《滴天髓》：甲木参天，脱胎要火。春不容金，秋不容土。火炽乘龙，水荡骑虎。地润天和，植立千古。
  
  `,
  // 甲木万物类象：
  // 天文：火星，雷，旭日和风，新星，温暖的气候。
  // 地理：森林，大路，桥梁，栋柱，楼梯，电梯，闹市，高楼大厦。
  // 人物：元首，统帅，家长，主将，主角，楷模，领导，兄长，董事长，师长，医师，军人，高人，君子，劳工。
  // 性情：刚健，正直，积极，木讷，自负，不圆滑，天真，不绝小节，好大喜功。
  // 身体：胆囊，头面，脚部，胡须，声音，指甲，上肢，脑神经中枢，经络，痉挛，抽，麻痹，躁证，嗝逆，呕吐。
  // 事务：创始，政治，总务，农林，木材业，建筑业，监督机构，起动，虚惊，鼓噪。
  // 植物：松树，柏树，杉树，椰树，荔芝，山楂，竹子，牧草，芦苇。
  // 动物：鹤，布谷鸟，云雀，画眉鸟，狮，老虎，猫科动物。鹿，蛇，壁虎。
  // 器物：萧，鼓，笛等音乐器材，手杖棍棒，电线杆，吉他等弹拨乐器。农林交通工具，汽车。
  // 数目：序数为1，五行数字为3。
  // 颜色：青绿色
  // 乙木的万物类像：
  // 天文气象：春之二月，月球的远近点，和风丽日，山风，冥王星。
  // 地理建筑：公园草地，山谷，观光果园，花店，风水的左砂，出入口，印刷厂，小桥，出版社，婚姻介绍所，门窗。
  // 人物伦常：高人贤士，文人学士，九流僧道，家母，妻子，妹妹，媒约，副将，副手，乐师。
  // 性情：柔而韧，婉转，能屈能伸，矫揉造作，依附世情，平和。
  // 身体疾病：肝脏，泪腺，毛发，手指，股部，嗅觉，魂，颈部，脖子，神经系统，眩晕，过敏。
  // 植物：兰蕙，灵芝，茶，杨柳，蔓藤。浮萍，寄生植物，有香气的植物。
  // 动物：鸳鸯，斑鹫，鹳，蝴蝶，蜻蜓，蚕，飞蛾，蛇，长颈鹿，穿山甲。
  // 器物用品：手工艺品，房子，柖子，盒子，床席，藤制品，假发，香水，空气清新剂，丝绸，文具，香料等。
  // 数目：序数为2，先天数8，六壬数6，五行数3，8。
  // 其他：碧绿色，黄绿色，六神中的“六合”奇门中占婚姻中的女家“日奇”。
  [TG.乙]: `
  《滴天髓》：乙木虽柔，到羊解牛。怀丁抱丙，跨凤乘猴。虚湿之地，骑马亦忧。藤萝系甲，可春可秋。

`,
  [TG.丙]:
    '《滴天髓》：丙火猛烈，欺霜侮雪。能椴庚金，从辛反怯。土众生慈，水猖显节。虎马犬乡，甲来成灭。',
  [TG.丁]:
    '《滴天髓》：丁火柔中，内性昭荣。抱乙而孝，合壬而忠。旺而不烈，衰而不穷。如有嫡母，可秋可冬。',
  [TG.戊]:
    '《滴天髓》：戊土固重，既中且正。静會动辟，万物司命。水润物生，火燥物病。如在艮坤，怕冲宜静。',
  [TG.己]:
    '《滴天髓》：己土卑湿，中正蓄藏。不愁木盛，不畏水旺。火少火晦，金多金光。若要物旺，宜助宜帮。',
  [TG.庚]:
    '《滴天髓》：庚金带煞，刚健为最。得水而清，得火而锐。土润则生，土干则脆。能羸甲兄，输于乙妹。',
  [TG.辛]:
    '《滴天髓》：辛金软弱，温润而清。畏土之多，乐水之盈。能扶社稷，能救生灵。热则喜母，寒则喜丁。',
  [TG.壬]:
    '《滴天髓》：壬水通河，能泄金气。刚中之德，周流不滞。通根透癸，冲天奔地。化则有情，从则相济。',
  [TG.癸]:
    '《滴天髓》：癸水至弱，达于天津。得龙而润，功化斯神。不愁火土，不论庚辛。合戊见火，化象斯真。',
  [DZ.子]: `
  子，阴水，本气癸水，无中余气。
  四正之一，又名四败、四沐浴、四桃花。
  `,
  [DZ.丑]: `
  丑，阴土，金之墓库，本气己土，中气癸水，余气辛金。
  四库之一，又名四（墓库、华盖、孤辰寡宿）。
  `,
  [DZ.寅]: `
  寅，阳木，本气甲木，中气丙火，余气戊土。
  四马之一，又名四偏、四长生。
  `,
  [DZ.卯]: `
  卯，阴木，本气乙木，无中余气。
  四正之一，又名四败、四沐浴、四桃花。
  `,
  [DZ.辰]: `
  辰，阳土，水之墓库，本气戊土，中气乙木，余气癸水。
  四库之一，又名四（墓库、华盖、孤辰寡宿）。
  `,
  [DZ.巳]: `
  巳，阳火，本气丙火，中气戊土，余气庚金。
  四马之一，又名四偏、四长生。
  `,
  [DZ.午]: `
  午，阴火，本气丁火，中气己土。
  四正之一，又名四败、四沐浴、四桃花。
  `,
  [DZ.未]: `
  未，阴土，木之墓库，本气己土，中气丁火，余气乙木。
  四库之一，又名四（墓库、华盖、孤辰寡宿）。
  `,
  [DZ.申]: `
  申，阳金，本气庚金，中气壬水，余气戊土。
  四马之一，又名四偏、四长生。
  `,
  [DZ.酉]: `
  酉，阴金，本气辛金，无中余气。
  四正之一，又名四败、四沐浴、四桃花。
  `,
  [DZ.戌]: `
  戌，阳土，火之墓库，本气戊土，中气辛金，余气丁火。
  四库之一，又名四（墓库、华盖、孤辰寡宿）。
  `,
  [DZ.亥]: `
  亥，阳水，本气壬水，中气甲木。
  四马之一，又名四偏、四长生。
  `,
  [Ten.比肩]: `
  与日主同五行，阴阳同性。
  比劫星，同性为正，异性为偏。

  比肩通常代表平神，正所谓看透比劫是神仙，比劫虽能帮身但也会劫财，真正的吉凶需要结合全盘来看。

  男命代表[堂]兄弟
  女命代表[堂]姐妹

  比肩心性
  为喜：刚健、果断、有毅力、不服输、勤奋努力、执行力强、自我意识强
  为忌：爱面子、自尊心强、据理力争、虚荣、死板、多疑、信口开河

  比肩取象
  为喜：得同辈帮助、竞争中取得名利、身体精力
  为忌：竞争、破财、官非口舌、病灾、婚灾
  `,
  [Ten.劫财]: `
  与日主同五行，阴阳异性。
  比劫星，同性为正，异性为偏。

  劫财作为四凶神之一，最怕见正财，有劫财见财之象
  需要注意的是，重点要看全局整体的情况而不是某一个星，有时凶星与吉星可以互相转换。
  物极必反，当异党过多时，劫财也帮挡官杀，羊刃驾杀；也可帮生食伤

  男命代表[堂]姐妹、儿媳(偏官之正财)、女婿的母亲(食神之正印)
  女命代表[堂]兄弟、公公(正官之偏财)、儿子的岳父(伤官之偏印)

  劫财心性
  为喜：自信、豪爽大方、热情直率、不怕困难、勇于竞争、口才好、朋友兄弟多
  为忌：冲动、霸道、争斗、自我、说话直、不顾他人感受

  劫财取象
  为喜：意志坚强、功成名就、事业有成、竞争得利
  为忌：打架斗殴、官非惹祸、克妻克父、贫困、病灾
  `,
  [Ten.食神]: `
  日主所生五行属性，阴阳同性。
  食伤星，同性为正，异性为偏。

  食神作为四吉神之一，代表着快乐、享受、自由、创意、智慧。食神制杀、食神生财都是很好的像
  需要注意的是，重点要看全局整体的情况而不是某一个星，有时凶星与吉星可以互相转换。
  食神最怕见偏印，枭神夺食

  男命代表女婿(正官之正官)、外公(正印之正财)、孙子(偏官之偏官)
  女命代表女儿、奶奶(正财之正印)

  食神心性
  为喜：温和斯文，思维细腻，宽容、善良、乐于奉献、人缘好、有福气、人文情怀
  为忌：爱幻想、想得多做得少、自尊心强、多情纵欲、纵情人间烟火、好逸恶劳

  食神取象
  为喜：平安、福气、口福、多才多艺、生活富裕
  为忌：贫困、劳累、疾病、抑郁`,
  [Ten.伤官]: `
  日主所生五行属性，阴阳异性。
  食伤星，同性为正，异性为偏

  劫财作为四凶神之一，怕见正官，有伤官见官之象
  需要注意的是，重点要看全局整体的情况而不是某一个星，有时凶星与吉星可以互相转换。
  物极必反，当官杀过强时，伤官也可制官杀，生财。更猛烈的偏星伤官会比食神更具创意，但可能不会长久。

  男命代表奶奶(偏财之正印)、岳母(正财之偏印)、孙女(偏官之正官)
  女命代表儿子、女婿的父亲(正印之偏财)、外公(偏印之正财)

  伤官心性
  为喜：聪明、悟性高、表现欲强、才华横溢、创新能力极强、追求完美、向往自由、个人魅力
  为忌：恃才傲物、争强好胜、不服管束、爱出风头、三分钟热度、自律性差、多情纵欲

  伤官取象
  为喜：才华横溢、升职创业、技术成果、商业头脑
  为忌：失业、降职、官灾、退学、疾病、官非纠纷
  `,
  [Ten.正印]: `
  能生日主的五行属性，阴阳异性。
  印星，阴阳异性为正，同性为偏。

  正印作为四吉神之一，是直接生扶日主的星，可以化官杀生身，制约伤官克制正官
  需要注意的是，重点要看全局整体的情况而不是某一个星，有时凶星与吉星可以互相转换。
  物极必反，当一片比劫印星同党过多时，好比只进不出，印星则为忌，喜财制印

  男命代表母亲、儿子的岳母(偏官之伤官)、外孙女(正官之食神)
  女命代表舅舅、孙子(伤官之偏官)、爷爷(正财之偏财)、女婿(食神之正官)

  正印心性
  为喜：仁慈、心地善良、安静平和、有同情心、有爱心、有修养、有智慧、注重内涵、有精神追求
  为忌：懒惰、行动力差、依赖性强、不思进取、优柔寡断、抑郁

  正印取象
  为喜：学历、荣誉、证书、靠山、贵人、房子、地位
  为忌：休学、失业、名声损毁、贫穷、懒惰
  `,
  [Ten.偏印]: `
  能生日主的五行属性，阴阳异性。
  印星，阴阳异性为正，同性为偏。

  偏印作为四凶神之一，又名枭神，怕见食神，有枭神夺食之象
  需要注意的是，重点要看全局整体的情况而不是某一个星，有时凶星与吉星可以互相转换。
  物极必反，官杀过重时，偏印也可化官杀生身

  男命代表舅舅、爷爷(偏财之偏财)、岳父(正财之正财)、外孙(正官之伤官)
  女命代表母亲、孙女(伤官之正官)

  偏印心性
  为喜：精明、领悟力强、善于观察、警觉性高、创造力强、好钻研、思想独特、喜怒不形于色、看透本质、天生的心理学家
  为忌：孤独、不合群、心机重、内向多疑、旁门左道、想事情总往坏处想、钻牛角尖、缺少人情味

  偏印取象
  为喜：偏业、学术、荣誉、思想成就、宗教、哲学、地位
  为忌：病灾、休学、失业、心理问题、偏印夺食会导致伤克子女
  `,
  [Ten.正官]: `
  克制日主的五行属性，阴阳异性。
  官星，阴阳异性为正，同性为偏。

  正官作为四吉神之一，财官是大多数人的追求，正官相比七杀更为柔和长久，是一股正向的约束力量，喜官印相生，比劫众多时还可以护财
  需要注意的是，重点要看全局整体的情况而不是某一个星，有时凶星与吉星可以互相转换。
  物极必反，身强以杀为官，身弱以官为杀。

  男命代表女儿、外婆(正印之偏印)
  女命代表丈夫
  
  正官心性
  为喜：自律、做事稳健、善于思考、有管理能力、遵守规矩、为人公道、责任心强、利于仕途公职发展。
  为忌：容易悲观、多虑、虚伪、不善变通、胆小怕事、意志不坚
  正官取象
  为喜：工作、名声、地位、事业
  为忌：官非、压力、疾病、贫困
  `,
  [Ten.七杀]: `
  克制日主的五行属性，阴阳同性。
  官星，阴阳异性为正，同性为偏。

  又因任意一个日主，往后数到第七位，必然是偏官，故名为七杀。
  七杀作为四凶神之首，有着特殊地位，在《五言独步》里面有句话，叫作：“有杀先论杀，无杀方论用”，因其是直接克制日主所以较为凶险，如果命局中出现七杀，要优先看待，找到解决方法。
  需要注意的是，重点要看全局整体的情况而不是某一个星，有时凶星与吉星可以互相转换。
  正所谓七杀有制化为权，七杀就像猛虎一旦制服所带来的收益也是最大的。喜食神制杀、杀印相生。

  男命代表儿子、女婿的父亲(食神之偏财)
  女命代表儿媳(伤官之正财)、女婿的母亲(正印之正印)、外婆(偏印之偏印)，无正官星时也可以代表丈夫
  
  七杀心性
  为喜：有魄力、机警伶俐、目标感强、思维缜密、敢想敢干、善于权谋、做事有手段、务实主义
  为忌：多疑多虑、胆大妄为、走捷径、冲动、好斗、七杀克身太重可能反过来胆小懦弱
  七杀取象
  为喜：名声、权力、地位、影响力、事业
  为忌：小人、伤灾、黑社会、被人欺、牢狱、贫贱
  `,
  [Ten.正财]: `
  日主克制的五行属性，阴阳异性。
  财星，阴阳异性为正，同性为偏。

  正财作为四吉神之一，财官是大多数人的追求，正财相比偏财更为柔和长久，往往是长期收入来源，印星过强时可以用财制印
  需要注意的是，重点要看全局整体的情况而不是某一个星，有时凶星与吉星可以互相转换。
  正财怕见劫财，有劫财见财之象。物极必反，财星过重时滋生官杀克身又会克印，若无食伤时日主受制严重。

  男命代表妻子
  女命代表父亲、外孙(食神之伤官)

  正财心性
  为喜：勤俭持家、脚踏实地、感情专一、守本分、不惹事、情绪感知能力强、注重细节、现实主义、善理财
  为忌：抠门、保守、小气、缺乏进取、过于计较和敏感

  正财取象
  为喜：钱财、事业、富裕、健康
  为忌：破财、贫困、疾病、婚灾
  `,
  [Ten.偏财]: `
  日主克制的五行属性，阴阳同性。
  财星，阴阳异性为正，同性为偏。

  偏财代表不可持续的意外之财，在当代偏星的猛烈有时比正财更被人喜爱。
  偏财通常代表平神，真正的吉凶需要结合全盘来看。
  当枭印夺食时偏财可以制约枭印

  男命代表父亲、儿子的岳父(偏官之偏印)
  女命代表婆婆(正官之正印)、外孙女(食神之食神)、儿子的岳母(伤官之伤官)

  偏财心性
  为喜：热情、大方、豁达、情商高、重情重义、善于交际、处事灵活、拿得起放得下
  为忌：欲望强、不克制、放纵情欲、风流、用心不专、不负责任、拜金主义
  
  偏财取象
  为喜：财运好、事业成功、生活富裕、多才多艺
  为忌：破财、贫困、疾病、婚灾、玩世不恭、铺张浪费
  `,
  [Ten.元男]: `
  日柱的天干，即为日主，代表盘中的自己。
  实战中，通过这个字与其他字的关系（生克制化及像），来判断全盘的情况，分析力量找主要矛盾，从而分析出喜用（各个属性的吉凶），最后在大运流年中根据吉凶及像应不同的事
  `,
  [Ten.元女]: `
  日柱的天干，即为日主，代表盘中的自己。
  实战中，通过这个字与其他字的关系（生克制化及像），来判断全盘的情况，分析力量找主要矛盾，从而分析出喜用（各个属性的吉凶），最后在大运流年中根据吉凶及像应不同的事
  `,
  [ZhangSheng.长生]: `
  长生：为人生第一阶段
  “长生”为人生的开始，是人面世的开端，并非是生命的开始。
  “长生”所体现的是生命力的开展。它并不是一个人生命力最强的阶段，却是生命力蕴藏最深厚的阶段。所以“长生”所在的宫垣，便带有“开启、悠久、积累、丰厚”的意味。
  当“长生”在命、身宫时：代表一个人生命力很强，且温厚聪明，寿命较长。
  当“长生”在兄弟宫时：象征一个人手足情深，或易得知己。
  当“长生”在父母宫时：意味一个人常得人提携照顾。
  当“长生”在财帛宫时：意味财富的积累。
  当“长生”在夫妻宫时：意味大小配（以小配为多）。凡夫妻宫不吉，坐“长生”而大小配者，往往无灾。
  当“长生”在子女宫时：意味（逢“胎、养、长生”）对子女之保育养护有利。
  三方四正逢“胎、养、长生”，为得子女之征兆。
  幼辈逢之，能解夭。
  余者类推。
  但“长生”最忌与空曜同宫，被“空、劫”所夹同论。`,
  [ZhangSheng.沐浴]: `
  沐浴：为人生第二阶段
  人出生后，需要沐浴，洗去从母胎中带来的血迹。
  所以从生命力而言，“沐浴”亦为“积蕴”的表徵。
  “沐浴”亦称桃花，为桃花诸曜之一，而且不是正桃花，常带有不良性质。尤其是在“子、午、卯、酉”四宫，但在“辰、戌、丑、未”四宫桃花性质便大为减少。
  “沐浴”与“昌、曲、化禄、禄存”同度之时，可将桃花转化为财禄，可视为因异性而得财。
  “沐浴”往往主与异性有关，见恶曜，主因异性，而导致破财、失职等状况。
  “沐浴”与“咸池、大耗、天姚、红鸾、天喜、天刑、阴煞”等同度之时，只能视作桃花。
  若又见“贪狼化忌”同度，加强夺爱的意味。
  倘若再见“昌、曲化忌”，主因桃花破财，并与异性发生纠纷。
  当“沐浴”在命、身宫时：主人优柔寡断，不听忠告，一生感情纠纷多。
  当“沐浴”在官禄宫时：职业易变。
  当“沐浴”在财帛宫时：生逢“败地”，发也需花。“沐浴”所在的宫位，即为“败地”。
  当“沐浴”在夫妻宫时：主夫妻关系和睦，反为佳格。
  沐浴也称为败地，当男人贪恋桃花之后容易多用金钱荒废事业以致衰败。`,
  [ZhangSheng.冠带]: `
  冠带: 为人生第三阶段
  古代男孩发育之后接受冠礼，表示其人已经长成。
  “冠带”代表初始长成，所以“冠带”所在的宫垣，便带有“成长成熟、积极向上、蓬勃发展、吉庆喜悦”的意味。
  当“冠带”在命、身宫时：主人好胜心强，要求高，喜批评别人，对事挑剔、苛刻，有名望，有权威，为自己打算，自私自利。
  当“冠带”在福德宫时：意味思想早熟，或思想成熟。再见“空曜及华盖”，主人倾向于哲理。
  当“冠带”在官禄宫时：意味事业有发展的希望。
  当“冠带”在父母、子女、夫妻、财帛、仆役宫时：无特殊意义，仅助吉星祥曜，将其性质略为加强。
  “冠带”喜与“昌曲、天才、龙池、凤阁”同度，主增加人的聪明才艺。
  `,
  [ZhangSheng.临官]: `
  临官: 为人生第四阶段
  人至成年后，应该出而问世，为社会服务。古人把出仕作为最佳出路，故为“临官”。
  “临官”为“服务与问世”的表徵。
  当“临官”与“天巫”同度时：有升迁的意义。
  当“临官”与桃花诸曜同度时：其人喜服务于异性，事业宜向这方面发展。
  “临官”喜与“七杀、破军”同度，特别是当“破军化禄、化权”时，主其人不守一业，喜欢多方面发展，所以多兼行兼业，或多兼职的机会。
  “临官”与“天同、天机”同度时，则仅主其人在事业发展上游移不定。
  “临官”与“魁、钺”同度，主其人宜服务于公共事业或政府机构。见“禄存、化禄”则主因为公众服务而进财。
  当“临官”在命、身宫时：主人白手起家，早年不顺，中晚年有成。
  不富则高寿。
  若为巨富之命，早年必丧妻。`,
  [ZhangSheng.帝旺]: `
  帝旺: 为人生第五阶段
  为人生命力最旺盛的阶段，如日中天。是生命力的顶峰，一过顶峰，便渐走下坡。
  “帝旺”为“气势与声价”的表徵，须注意由顶峰下泻的危险。
  当“帝旺”在命、身宫时：主人傲气，做事一意孤行，绝无依赖心理，独来独往，喜欢以自己的喜好来创造未来。不向人低头，过于自傲，易得罪人，成就颇费苦心。
  女命坐“帝旺”：豪爽，有男子气，贞洁。
  当“帝旺”在官禄宫时：往往主突发，尤其与辅佐诸曜同度时，更确。
  当与“火贪”、“铃贪”同度时，主暴起暴跌、暴发暴败。
  当“帝旺”与“紫微、天府、日生人的太阳、夜生人的太阴”同度时，若再得百官朝拱，主当局者有非常强的领导力，且事业上有气派。
  （当事业与财源一走下坡路的时候，便应当立刻改弦易辙，避免破败。)`,
  [ZhangSheng.衰]: `
  衰: 为人生第六阶段
  代表人的生机开始由旺转弱，即所谓的“盛极必衰”。
  “衰” 在命、身宫：主人无生气，缺乏斗志，容易虎头蛇尾。外表沉静，内心急躁，没耐心。
  女命在“衰”：外貌文静、秀气，内心却较刁蛮。
  “衰” 在财帛宫：代表对求财缺乏自信心。
  “衰” 在官禄宫：代表其人事业心不强。宜守成，不宜创业，若创业必艰难困苦。
  “衰”在六亲：往往代表的亲切变成疏离。
  “衰”对全局的影响不大，只对流月、流日起相当大的作用。`,
  [ZhangSheng.病]: `
  病: 为人生第七阶段
  代表人的生机由旺转衰后，以往累积之病灶，暴露出来，便容易生病。
  “病”无非是“衰”的极致。
  “病”在命、身宫：不表病，只代表人的生命力不够强，或意志不够坚定，做事没恒心，喜幻想，名声不响亮。
  可能有二次婚姻，早年若无婚变，中年后夫妻关系会渐渐失和。
  “病”在财帛宫：代表求财的欲望不大，而且往往缺乏实际行动，若煞忌同度，则代表常因病而花钱。
  “病”在官禄宫：代表其人事业心不强。若见“天梁、天月”同时又见吉曜，则代表其人宜、从事与疾病有关的职业。
  “病”在六亲：六亲缘分不足。
  “病”在疾厄宫：老、少运逢之，易患重病。
  “病”对全局的影响不大，只对流月、流日起相当大的作用。
  但当“病” 入流日命宫，往往有小不适。`,
  [ZhangSheng.死]: `
  死: 为人生第八阶段
  “死”不是指死亡，而是生命力相当之弱。
  “死”在命、身宫、福德宫：代表其人容易优柔寡断，消极，个性固执，喜钻牛角尖，冥顽不化。
  “死”在官禄宫：代表凡事随缘，不主动争取。
  “死”在财帛宫：代表绝不争取赚钱的机会。
  “死” 在六亲：代表与六亲关系相当疏远。尤其是在父母宫，如无吉星祥曜，而煞忌刑曜齐集时，往往代表无父母的荫庇力，或跟上司关系不密切。
  “死”在疾厄宫：老、少运亦不喜逢之，易带病延年。
  “死”对全局的影响不大，只对流月、流日起相当大的作用。
  但当“死” 入流日命宫，该日便容易懒懒散散。`,
  [ZhangSheng.墓]: `
  墓: 为人生第九阶段
  “墓”，并不代表生机断绝，或生命消灭，而是指生命力的“隐藏与潜伏”。
  “墓”在命、身宫：为人不够开朗，死气沉沉。
  “墓”在财帛宫：主积聚，尤其是见“化禄”进入后，便为积蓄储存的表徵。
  “禄存”不入墓库，亦喜在三方会合。
  若浮动的星曜“化禄”，入墓库，可以增加其稳定性（如“天机化禄”等）。`,
  [ZhangSheng.绝]: `
  绝: 为人生第十阶段
  即走到绝路，性质最为不祥，代表人生发展过程中，一切生机都已断绝，为彻底的绝灭，但仍不代表死亡。
  “绝”在疾厄宫：主病后恢复期长，且比较困难。
  “绝”在六亲：彼此关系非常疏远。
  “绝”在财帛宫、官禄宫：灰心丧志。`,
  [ZhangSheng.胎]: `
  胎: 为人生第十一阶段
  属生命的转机，当生命灭绝后，重新结胎，于是新生命便开始了。
  “胎”，是生机的开始，并不强壮，甚至还很孱弱。
  “胎”在命、身宫：其人意志力并不坚强，带幼稚的性质。
  若见“天同”：会使“天同”更趋于情绪化。
  若见“天机”：会使“天机”更不稳定。
  但对其他星曜的影响作用不大。
  另外“胎”还代表希望。
  喜入财帛宫、官禄宫，见“入庙的太阳、太阴、天梁”同度：主擅长开展性的计划。
  “胎”为酝酿之喜。流年配合其他星曜有怀孕迹兆
  `,
  [ZhangSheng.养]: `
  养: 为人生第十二阶段
  八字中为进气
  为长养。
  结胎之后需要长养，因此可视为与“墓”曜相对，两颗星曜都代表潜藏隐伏。
  “墓”曜代表衰落时的隐藏。
  “养”曜代表生机发展尚未完全成熟的隐藏。与《周易》乾卦初九的“潜龙勿用”意义相同。
  “养”比“胎”更加积极，在十二宫，皆可视作孕育、伺机发动的潜伏期。
  “养”在疾厄宫：较为不吉，若同度正曜不吉，则为患上潜伏性的疾病。
  “养”在财帛宫、官禄宫：注意“潜龙勿用”的特性，可以积极计划，培养元气，但不可冒昧行动。`,
};
