import {DZ, TG} from './wuxing';

// enum TH_LEVEL {
//   '极佳',
//   '较佳',
//   '不佳',
// }

// TODO target
export const DH_MAP: Record<TG, Record<DZ, {text: string; target: TG[]}>> = {
  [TG.甲]: {
    [DZ.寅]: {
      text: '寅月丙，癸调与气候为要，丙火为主，癸水为佐。',
      target: [TG.丙, TG.癸],
    },
    [DZ.卯]: {
      text: '卯月庚，丙，丁，戊，己。阳刃架杀，专用庚金，以戊，己滋杀为佐；无庚，用丙，丁泄秀，不取制杀。',
      target: [],
    },
    [DZ.辰]: {
      text: '辰月庚，丁，壬。用庚金必须丁火制之，为伤官制杀，无庚用壬。',
      target: [],
    },
    [DZ.巳]: {
      text: '巳月癸，庚，丁调与气候，癸水为主；原局气润，庚丁为用。',
      target: [],
    },
    [DZ.午]: {
      text: '午月癸，庚，丁木性虚焦，癸为主要，无癸用丁，亦应该运行北地；木盛先庚，庚盛先丁。',
      target: [],
    },
    [DZ.未]: {
      text: '未月癸，庚，丁上半月同五月用癸．下半月用庚丁。',
      target: [],
    },
    [DZ.申]: {
      text: '申月庚，丁，壬伤官制煞，用丙调候，丁丙并用为佐。',
      target: [],
    },
    [DZ.酉]: {
      text: '酉月庚，丁，丙用丁制然，用丙调候，丁丙并用为佐。',
      target: [],
    },
    [DZ.戌]: {
      text: '戌月庚，甲，丁，壬，癸土旺者用甲木，木旺者用庚金，丁，壬，癸为佐。',
      target: [],
    },
    [DZ.亥]: {
      text: '亥月庚，丁，丙，戊用庚金，取丁火制之，丙火调候，水旺用戊。',
      target: [],
    },
    [DZ.子]: {
      text: '子月丁，庚，丙木性生寒，丁先庚后，丙火为佐，为助，用庚劈甲引丁。',
      target: [],
    },
    [DZ.丑]: {
      text: '丑月丁為必須，次庚丙，通寅巳佳。',
      target: [],
    },
  },
  [TG.乙]: {
    [DZ.寅]: {
      text: '寅月丙，癸取丙火解寒，略取癸水滋润，不应该困丙。',
      target: [],
    },
    [DZ.卯]: {
      text: '卯月丙，癸以癸木，以丙泄秀，不应该见金。',
      target: [],
    },
    [DZ.辰]: {
      text: '辰月癸，丙，戊若支成水局，取戊为佐。',
      target: [],
    },
    [DZ.巳]: {
      text: '巳月癸月令丙火得禄，专用癸水，调候为急。',
      target: [],
    },
    [DZ.午]: {
      text: '午月癸，丙上半月专用癸水，下半月丙癸并用。',
      target: [],
    },
    [DZ.未]: {
      text: '未月癸，丙润土滋木，喜用癸水，柱多金水，先用丙火，夏月壬癸，切忌戊，己杂乱。',
      target: [],
    },
    [DZ.申]: {
      text: '申月丙，癸，己月垣庚金司令，取丙火制之，或癸水化之，不论用丙用癸，皆己土为佐。',
      target: [],
    },
    [DZ.酉]: {
      text: '酉月癸，丙，丁上半月癸先丙后，下半月丙先癸后，无癸用壬，支成金局，又应该用丁。',
      target: [],
    },
    [DZ.戌]: {
      text: '戌月癸，辛以金发水之源，见甲，名藤萝系甲。',
      target: [],
    },
    [DZ.亥]: {
      text: '亥月丙，戊乙木向阳，专取丙火，水多以戊佐。',
      target: [],
    },
    [DZ.子]: {
      text: '子月丙寒木向阳，专取丙火，忌见癸水。',
      target: [],
    },
    [DZ.丑]: {
      text: '丑月丙寒谷回春，专用丙火。',
      target: [],
    },
  },

  [TG.丙]: {
    [DZ.寅]: {
      text: '寅月壬，庚。壬水为用，庚金发水之源为佐。',
      target: [],
    },
    [DZ.卯]: {
      text: '卯月壬，己。专用壬水，水多用戊制之，身弱用印化之。',
      target: [],
    },
    [DZ.辰]: {
      text: '辰月壬，甲。专用壬水，土重以甲为佐。',
      target: [],
    },
    [DZ.巳]: {
      text: '巳月壬，癸，庚。以庚为佐，忌戊制壬，无壬用癸。',
      target: [],
    },
    [DZ.午]: {
      text: '午月壬，庚。壬庚以通根申宫为妙',
      target: [],
    },
    [DZ.未]: {
      text: '未月壬，庚，以庚为佐。',
      target: [],
    },
    [DZ.申]: {
      text: '申月壬，戊。壬水通根申宫，壬多必取戊制。',
      target: [],
    },
    [DZ.酉]: {
      text: '酉月壬，癸。四柱多丙，一壬高透为奇。无壬用癸。',
      target: [],
    },
    [DZ.戌]: {
      text: '戌月甲，壬。忌土晦光，先取甲疏土，次用壬水。',
      target: [],
    },
    [DZ.亥]: {
      text: '亥月甲，戊，庚，壬。月垣壬水秉令，水旺用甲木化之，身煞两旺，用戊制之，火旺用壬，木旺应该庚。',
      target: [],
    },
    [DZ.子]: {
      text: '子月壬，戊，己。气进二阳，丙火弱中复强，用壬水，用戊制之，无戊用己。',
      target: [],
    },
    [DZ.丑]: {
      text: '丑月壬，甲。喜壬为用，土多不可少甲。',
      target: [],
    },
  },
  [TG.丁]: {
    [DZ.寅]: {
      text: '寅月甲，庚。用庚金劈甲引丁',
      target: [],
    },
    [DZ.卯]: {
      text: '卯月庚，甲，以庚去乙，以甲引丁。',
      target: [],
    },
    [DZ.辰]: {
      text: '辰月甲，庚。用甲木引丁制土，次看庚金。',
      target: [],
    },
    [DZ.巳]: {
      text: '巳月甲，庚。取甲引丁，甲多又取庚为先。',
      target: [],
    },
    [DZ.午]: {
      text: '午月壬，庚，癸。火多以庚壬两透为贵，无壬用癸，为独煞当权。',
      target: [],
    },
    [DZ.未]: {
      text: '未月甲，壬，庚。以甲木化壬引丁为用，用甲不能无庚，取庚为佐。',
      target: [],
    },
    [DZ.申]: {
      text: '申月甲，庚，丙，戊。取庚劈甲，无甲用乙，用丙暖金晒甲，无庚甲而用乙者，见丙为枯草引灯，水旺用戊。',
      target: [],
    },
    [DZ.酉]: {
      text: '酉月甲，庚，丙，戊。取庚劈甲，无甲用乙，用丙暖金晒甲，无庚甲而用乙者，见丙为枯草引灯，水旺用戊。',
      target: [],
    },
    [DZ.戌]: {
      text: '戌月甲，庚，戊。一派戊土无甲，为伤官伤尽。',
      target: [],
    },
    [DZ.亥]: {
      text: '亥月甲，庚。庚金劈甲引丁，甲木为尊，庚金为佐，戊癸权应该酌用。',
      target: [],
    },
    [DZ.子]: {
      text: '子月甲，庚。庚金劈甲引丁，木尊，庚金为佐，戊癸权应该酌用。',
      target: [],
    },
    [DZ.丑]: {
      text: '丑月甲，庚。庚金劈甲引丁，甲木为尊，庚金为佐，戊癸权应该酌用。',
      target: [],
    },
  },

  [TG.戊]: {
    [DZ.寅]: {
      text: '寅月丙，甲，癸。无丙照暖，戊土不生，无甲疏劈，戊土不灵；无癸滋润，万物不长，先丙，次甲，次癸。',
      target: [],
    },
    [DZ.卯]: {
      text: '卯月丙，甲，癸。无丙照暖，戊土不生，无甲疏劈，戊土不灵；无癸滋润，万物不长，先丙，次甲，次癸。',
      target: [],
    },
    [DZ.辰]: {
      text: '辰月甲，丙，癸。戊土司令，先用甲疏，次丙，次癸。',
      target: [],
    },
    [DZ.巳]: {
      text: '巳月甲，丙，癸。戊土建禄，先用甲疏劈，次取丙癸。',
      target: [],
    },
    [DZ.午]: {
      text: '午月壬，甲，丙。调候为急，先用壬水，次取甲木，丙火配用。',
      target: [],
    },
    [DZ.未]: {
      text: '未月癸，丙，甲。调候为急，癸不可缺，丙火配用，土重不能无甲。',
      target: [],
    },
    [DZ.申]: {
      text: '申月丙，癸，甲。寒气渐增，先用丙火．水多，用甲泄之。',
      target: [],
    },
    [DZ.酉]: {
      text: '酉月丙，癸。赖丙照暖，喜水滋润，戌月甲，丙，癸。',
      target: [],
    },
    [DZ.戌]: {
      text: '戊土当权，先用甲木，次取丙火，见金，先用癸水，后取丙火。',
      target: [],
    },
    [DZ.亥]: {
      text: '亥月甲，丙。非甲不灵，非丙不暖。',
      target: [],
    },
    [DZ.子]: {
      text: '子月丙，甲。丙火为尚，甲木为佐。',
      target: [],
    },
    [DZ.丑]: {
      text: '丑月丙，甲。丙火为尚，甲木为佐。',
      target: [],
    },
  },

  [TG.己]: {
    [DZ.寅]: {
      text: '寅月丙，庚，甲。取丙解寒，忌见壬水，如水多，须以戊土为佐；土多用甲，甲多用庚。',
      target: [],
    },
    [DZ.卯]: {
      text: '卯月甲，癸，丙。用甲忌与己土合化，次用癸水润之。',
      target: [],
    },
    [DZ.辰]: {
      text: '辰月丙，癸，甲。先丙后癸，土暖而润，随用甲疏。',
      target: [],
    },
    [DZ.巳]: {
      text: '巳月癸，丙。调候不能无癸，土润不能无丙。',
      target: [],
    },
    [DZ.午]: {
      text: '午月癸，丙。调候不能无癸，土润不能无丙。',
      target: [],
    },
    [DZ.未]: {
      text: '未月癸，丙。调候不能无癸，土润不能无丙。',
      target: [],
    },
    [DZ.申]: {
      text: '申月丙，癸。丙火温土，癸水润土，七月庚金司权，丙能制金，癸以泄金。',
      target: [],
    },
    [DZ.酉]: {
      text: '酉月丙，癸。取辛辅癸。',
      target: [],
    },
    [DZ.戌]: {
      text: '戌月甲，丙，癸。九月土盛，应该甲木疏之，次用丙癸。',
      target: [],
    },
    [DZ.亥]: {
      text: '亥月丙，甲，戊。三冬己土，非丙暖不生，初冬壬旺，取戊土制之，土多，取甲木疏之。',
      target: [],
    },
    [DZ.子]: {
      text: '子月丙，甲，戊。三冬己土非丙暖不生，壬水太旺，取戊土制之，土多，取甲木疏之。',
      target: [],
    },
    [DZ.丑]: {
      text: '丑月丙，甲，戊。三冬己土非丙暖不生，壬水太旺，取戊土制之，土多，取甲木疏之。',
      target: [],
    },
  },

  [TG.庚]: {
    [DZ.寅]: {
      text: '寅月戊，甲，壬，丙，丁。用丙暖庚性，虑土厚埋金，须甲疏泄，火多用土，支成火局用壬。',
      target: [],
    },
    [DZ.卯]: {
      text: '卯月丁，甲，庚，丙。庚金暗强，专用丁火，借甲引丁，用庚劈甲，无丁用丙。',
      target: [],
    },
    [DZ.辰]: {
      text: '辰月甲，丁，壬，癸。顽金应该丁，旺土用甲，不用庚劈，支火应该癸，干火应该壬。',
      target: [],
    },
    [DZ.巳]: {
      text: '巳月壬，戊，丙，丁。丙不金，惟喜壬制，次取戊土，丙火为佐，支成金局，变弱为强，须用丁火。',
      target: [],
    },
    [DZ.午]: {
      text: '午月壬，癸。专用壬水，癸次之，须支见庚辛为助，无壬，癸，用戊，己泄火之气。',
      target: [],
    },
    [DZ.未]: {
      text: '未月丁，甲。若支会土局，甲先丁后。',
      target: [],
    },
    [DZ.申]: {
      text: '申月丁，甲。专用丁火，甲木引丁。',
      target: [],
    },
    [DZ.酉]: {
      text: '酉月丁，甲，丙，用丁甲金，兼用丙火调候。',
      target: [],
    },
    [DZ.戌]: {
      text: '戌月甲，壬。土厚先用甲疏，次用壬洗。',
      target: [],
    },
    [DZ.亥]: {
      text: '亥月丁，丙。水冷金寒爱丙丁，甲木辅丁。',
      target: [],
    },
    [DZ.子]: {
      text: '子月丁，甲，丙。首取丁甲，次取丙火照暖，一派金水，不入与暖之乡，孤贫。丙丁须临寅巳午未戌支，方为有力。',
      target: [],
    },
    [DZ.丑]: {
      text: '丑月丙，丁，甲。首取丁甲，次取丙火照暖，一派金水，不入与暖之乡，孤贫。丙丁须临寅巳午未戌支，方为有力。',
      target: [],
    },
  },

  [TG.辛]: {
    [DZ.寅]: {
      text: '寅月己，壬，庚。辛金失令，取己土为生身之，本欲得辛金发用，全赖壬水之功。壬己并用，人庚为助。',
      target: [],
    },
    [DZ.卯]: {
      text: '卯月壬，甲。辛金失令，取己土为生身之，本欲得辛金发用，全赖壬水之功。壬己并用，人庚为助。',
      target: [],
    },
    [DZ.辰]: {
      text: '辰月壬，甲。若见丙火合辛，须有癸制丙，支见亥子申，为贵。',
      target: [],
    },
    [DZ.巳]: {
      text: '巳月壬，甲，癸。壬水洗淘，兼有调候之用，更有甲木制戊，一清澈底。',
      target: [],
    },
    [DZ.午]: {
      text: '午月壬，己，癸。己无壬不湿，辛无巳不生，故壬，巳并用，无壬用癸。',
      target: [],
    },
    [DZ.未]: {
      text: '未月壬，庚，甲。先用壬水，取庚为佐，忌戊出，得甲制之，方吉。',
      target: [],
    },
    [DZ.申]: {
      text: '申月壬，甲，戊。壬水为，甲戊酌用，不可用癸水。',
      target: [],
    },
    [DZ.酉]: {
      text: '酉月壬，甲。壬水淘洗，如见戊己，须甲制土，支成金局无壬须用丁火。',
      target: [],
    },
    [DZ.戌]: {
      text: '戌月壬，甲。月辛金，火土为病，水木为药。',
      target: [],
    },
    [DZ.亥]: {
      text: '亥月壬。先壬后丙，名金白水清，馀皆酌用。',
      target: [],
    },
    [DZ.子]: {
      text: '子月丙，戊，壬，申。冬月辛金，不能缺丙火温暖，馀皆酌用。',
      target: [],
    },
    [DZ.丑]: {
      text: '丑月壬，戊，己。同上，壬先，戊己次之，丙火不可少也。',
      target: [],
    },
  },

  [TG.壬]: {
    [DZ.寅]: {
      text: '寅月庚，丙，戊。无比劫者，不必用戊，专用庚金，以丙为佐，如比劫多，又应该制之，一戊出，名一将当关，群邪自伏。',
      target: [],
    },
    [DZ.卯]: {
      text: '卯月戊，辛，庚。三春壬水绝地，取庚，辛发水之源，水多用戊。',
      target: [],
    },
    [DZ.辰]: {
      text: '辰月甲，庚。甲疏季上，次取庚金发水源，金多预丙制之为妙。',
      target: [],
    },
    [DZ.巳]: {
      text: '巳月壬，辛庚，癸。壬水弱极，取庚，辛为源，壬癸比劫。',
      target: [],
    },
    [DZ.午]: {
      text: '午月癸，庚，辛。取庚为源，取癸为佐，无庚用辛。',
      target: [],
    },
    [DZ.未]: {
      text: '未月辛，甲。以辛金发水源，甲木疏土。',
      target: [],
    },
    [DZ.申]: {
      text: '申月戊，丁。取丁火佐戊制庚，戊土通根辰戌，丁火通根午戌，方可为用。',
      target: [],
    },
    [DZ.酉]: {
      text: '酉月甲，庚。无甲，用金发水之源，名独水犯庚辛，体全之义。',
      target: [],
    },
    [DZ.戌]: {
      text: '戌月甲，丙。以甲制戌中戊土，丙火为佐。',
      target: [],
    },
    [DZ.亥]: {
      text: '亥月戊，丙，庚。如甲出制戊，须以庚金为救。',
      target: [],
    },
    [DZ.子]: {
      text: '子月戊，丙。水旺应该戊，调候应该丙，丙戊必须兼用。',
      target: [],
    },
    [DZ.丑]: {
      text: '丑月丙，丁，甲。上半月专用丙火，下半月用丙，甲木为佐。',
      target: [],
    },
  },

  [TG.癸]: {
    [DZ.寅]: {
      text: '寅月辛，丙。用辛生癸水为源，无辛用庚，丙不可少。',
      target: [],
    },
    [DZ.卯]: {
      text: '卯月庚，辛。乙木司令，专用庚金，辛金次之。',
      target: [],
    },
    [DZ.辰]: {
      text: '辰月丙，辛，甲。上半月专用丙火，下半月虽用丙火，辛甲为佐。',
      target: [],
    },
    [DZ.巳]: {
      text: '巳月辛。无辛用庚。',
      target: [],
    },
    [DZ.午]: {
      text: '午月庚，辛，壬，癸。庚辛为生身之本，但丁火司权，金难敌火，应该兼用比劫，方得庚辛之用。',
      target: [],
    },
    [DZ.未]: {
      text: '未月庚，辛，壬，癸。上半月金神衰弱，火气炎热，应该比劫帮身，同五月。',
      target: [],
    },
    [DZ.申]: {
      text: '申月丁。庚金得禄，必丁火制金为用，丁火以通根午戌未为妙。',
      target: [],
    },
    [DZ.酉]: {
      text: '酉月辛，丙。辛金为用，丙火佐之，名水暖金温，须隔位同透。',
      target: [],
    },
    [DZ.戌]: {
      text: '戌月辛，甲，壬，癸。专用辛金，忌戊土，要比劫滋甲，制戊为妙。',
      target: [],
    },
    [DZ.亥]: {
      text: '亥月庚，辛，戊，丁。亥中甲木长生，泄散元神，应该用庚，辛。水多用戊，金多用丁。',
      target: [],
    },
    [DZ.子]: {
      text: '子月丙，辛。丙火解冻，辛金滋扶。',
      target: [],
    },
    [DZ.丑]: {
      text: '丑月丙，丁。丙火解冻，通根寅巳午未戌，方妙，癸巳会党，年透丁火，名雪后灯光，夜生者贵；支成火局，又应该用庚辛。',
      target: [],
    },
  },
};
